98_openfoam_learning_manual/example/seimic_darcy_flow/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    left_right
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    front_back
    {
        type            slip;
    }

    bottom
    {
        type            slip;
    }
}
