98_openfoam_learning_manual/example/seimic_darcy_flow/0.orig/porosity
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      porosityMedia;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }

    left_right
    {
        type            zeroGradient;
    }

    front_back
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
}
