98_openfoam_learning_manual/example/seimic_darcy_flow/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

touch $(getApplication).foam

restore0Dir

runApplication blockMesh

runApplication decomposePar

runParallel setFields

runParallel $(getApplication)

runApplication reconstructPar -withZero

#------------------------------------------------------------------------------
