98_openfoam_learning_manual/example/seimic_darcy_flow/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

dynamicFvMesh   staticFvMesh;
