98_openfoam_learning_manual/example/seimic_darcy_flow/constant/porosityProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      porosityProperties;
}

porosityMediaEnabled true;

porosityModel JensenEtAl2014;

JensenEtAl2014Coeffs
{
    alpha     150;
    beta      1.0;
    d50       0.001;
    KC        10.0;
    gamma_p   0.34;
}