98_openfoam_learning_manual/example/seimic_darcy_flow/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// when changing phases, also change the keywords in system/sertFieldDict
phases (water air);  

water
{
    transportModel  Newtonian;
    nu              1.0e-6;
    rho             1000;
}

air
{
    transportModel  Newtonian;
    nu              14.8e-06;
    rho             1.2;
}

sigma               0.07;

