98_openfoam_learning_manual/example/seimic_darcy_flow/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

vertices
(
    (-1.2 -0.05 -0.2)
    ( 1.2 -0.05 -0.2)
    ( 1.2  0.05 -0.2)
    (-1.2  0.05 -0.2)
    (-1.2 -0.05  0.0)
    ( 1.2 -0.05  0.0)
    ( 1.2  0.05  0.0)
    (-1.2  0.05  0.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (240 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    left_right
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
        );
    }

    front_back
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (3 2 1 0)
        );
    }
);

mergePatchPairs
(
);
