98_openfoam_learning_manual/example/seimic_darcy_flow/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     unresolvedCFDdem;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20.0;

deltaT          0.001;

writeControl    adjustable;

writeInterval   0.1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;

maxAlphaCo      0.5;

maxDeltaT       1;


