98_openfoam_learning_manual/example/seimic_darcy_flow/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 8;

method          simple;

coeffs
{
    n           (2 2 2);
}
