98_openfoam_learning_manual/example/seimic_darcy_flow/system/demDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      demDict;
}

createDEMfile  "createDEM";
createDEMfunc  "createDEM";