98_openfoam_learning_manual/example/seimic_darcy_flow/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "alpha.water.*"
    {
        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;
        reconstructionScheme isoAlpha;
        writeFields     true;

        nAlphaSubCycles 1;
        cAlpha          1; 
    }
    
    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-09;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-09;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    UFinal
    {
        $U;
    }

    phiIB
    {
        $p_rgh;
        tolerance       1e-09;
        relTol          0;
    }

    phiIBFinal
    {
        $phiIB;
    }
}


PIMPLE
{
    momentumPredictor yes;
    nCorrectors       3;
    nOuterCorrectors  1;
    nNonOrthogonalCorrectors 0;
    pRefCell          0;
    pRefValue         0;
}
