98_openfoam_learning_manual/example/seimic_darcy_flow/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue porosityMedia 0.3
    volScalarFieldValue alpha.water 1.0
);

regions
(
    boxToCell
    {
        box (-0.2 -0.5 -0.2) (0.2 0.5 0.0);
        fieldValues
        (
            volScalarFieldValue porosityMedia 0.9
            volScalarFieldValue alpha.water 0.0
        );
    }
);

